<?xml version="1.0" encoding="utf-8"?>
<!--
Copyright (c) Microsoft Corporation. All rights reserved.
-->
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="AppDeviceInventory">App and Device Inventory</string>
      <string id="AppDeviceInventoryTurnOffInstallTracing">Turn off Install Tracing</string>
      <string id="AppDeviceInventoryTurnOffInstallTracing_Help">This policy controls the state of Install Tracing. Install Tracing is a mechanism that tracks application installs to help diagnose compatibility problems.

If you enable this policy, Install Tracing will not be run.

If you disable or do not configure this policy, Install Tracing will be turned on.
      </string>
      <string id="AppDeviceInventoryTurnOffAPISamping">Turn off API Sampling</string>
      <string id="AppDeviceInventoryTurnOffAPISamping_Help">This policy controls the state of API Sampling. API Sampling monitors the sampled collection of application programming interfaces used during system runtime to help diagnose compatibility problems.

If you enable this policy, API Sampling will not be run.

If you disable or do not configure this policy, API Sampling will be turned on.
      </string>
      <string id="AppDeviceInventoryTurnOffApplicationFootprint">Turn off Application Footprint</string>
      <string id="AppDeviceInventoryTurnOffApplicationFootprint_Help">This policy controls the state of Application Footprint. Application Footprint monitors the sampled collection of registry and file usage to help diagnose compatibility problems.

If you enable this policy, Application Footprint will not be run.

If you disable or do not configure this policy, Application Footprint will be turned on.
      </string>
      <string id="AppDeviceInventoryTurnOffWin32AppBackup">Turn off compatibility scan for backed up applications</string>
      <string id="AppDeviceInventoryTurnOffWin32AppBackup_Help">This policy controls the state of the compatibility scan for backed up applications. The compatibility scan for backed up applications evaluates for compatibility problems in installed applications.

If you enable this policy, the compatibility scan for backed up applications will not be run.

If you disable or do not configure this policy, the compatibility scan for backed up applications will be run.
      </string>
    </stringTable>
  </resources>
</policyDefinitionResources>
