<?xml version="1.0" encoding="utf-8"?>
<!--  Copyright (C) Microsoft Corporation. All rights reserved  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
       <string id="Feeds">News and interests</string>
       <string id="EnableFeeds">Enable news and interests on the taskbar</string>
       <string id="ExplainEnableFeeds">This policy setting specifies whether news and interests is allowed on the device.</string>
    </stringTable>
  </resources>
</policyDefinitionResources>
