<?xml version="1.0" encoding="utf-8"?>
<!-- Copyright (c) Microsoft Corporation. All rights reserved.  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="WindowsCopilot">Windows Copilot</string>
      <string id="TurnOffWindowsCopilot">Turn off Windows Copilot</string>
      <string id="TurnOffWindowsCopilot_Help">
        This policy setting allows you to turn off Windows Copilot.

        If you enable this policy setting, users will not be able to use Copilot. The Copilot icon will not appear on the taskbar either.

        If you disable or do not configure this policy setting, users will be able to use Copilot when it's available to them.
      </string>
      <string id="WindowsAI">Windows AI</string>
      <string id="DisableAIDataAnalysis">Turn off Saving Snapshots for Windows</string>
      <string id="DisableAIDataAnalysis_Help">
        This policy setting allows you to control whether Windows saves snapshots of the screen and analyzes the user's activity on their device.

        If you enable this policy setting, Windows will not be able to save snapshots and users won't be able to search for or browse through their historical device activity using Recall.

        If you disable or do not configure this policy setting, Windows will save snapshots of the screen and users will be able to search for or browse through a timeline of their past activities using Recall. 
      </string>
    </stringTable>
  </resources>
</policyDefinitionResources>
