<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2015 Microsoft Corporation  -->
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <policyNamespaces>
    <target prefix="accountnotifications" namespace="Microsoft.Policies.AccountNotifications" />
    <using prefix="windows" namespace="Microsoft.Policies.Windows" />
  </policyNamespaces>
  <resources minRequiredRevision="1.0" />
  <categories>
    <category name="AccountNotifications" displayName="$(string.AccountNotifications)">
      <parentCategory ref="windows:WindowsComponents" />
    </category>
  </categories>
  <policies>
    <policy name="DisableAccountNotifications" class="User" displayName="$(string.DisableAccountNotifications)" explainText="$(string.DisableAccountNotificationsExplain)" key="SOFTWARE\Policies\Microsoft\Windows\CurrentVersion\AccountNotifications" valueName="DisableAccountNotifications">
      <parentCategory ref="AccountNotifications" />
      <supportedOn ref="windows:SUPPORTED_Windows_10_0_VB_Only_NOSERVER" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
  </policies>
</policyDefinitions>
