<?xml version="1.0" encoding="utf-8"?>
<!--
Copyright (c) Microsoft Corporation. All rights reserved.
-->
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <policyNamespaces>
    <target prefix="appdeviceinventory" namespace="Microsoft.Policies.AppDeviceInventory" />
    <using prefix="windows" namespace="Microsoft.Policies.Windows" />
  </policyNamespaces>
  <resources minRequiredRevision="1.0" />
  <categories>
    <category name="AppDeviceInventory" displayName="$(string.AppDeviceInventory)">
      <parentCategory ref="windows:WindowsComponents" />
    </category>
  </categories>
  <policies>
    <policy name="TurnOffInstallTracing" class="Machine" displayName="$(string.AppDeviceInventoryTurnOffInstallTracing)" explainText="$(string.AppDeviceInventoryTurnOffInstallTracing_Help)" key="Software\Policies\Microsoft\Windows\AppCompat" valueName="DisableInstallTracing">
      <parentCategory ref="AppDeviceInventory" />
      <supportedOn ref="windows:SUPPORTED_Windows_11_0_24H2" />
      <!-- "Enabled" here means we are turning off Install Tracing. -->
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="TurnOffAPISamping" class="Machine" displayName="$(string.AppDeviceInventoryTurnOffAPISamping)" explainText="$(string.AppDeviceInventoryTurnOffAPISamping_Help)" key="Software\Policies\Microsoft\Windows\AppCompat" valueName="DisableAPISamping">
      <parentCategory ref="AppDeviceInventory" />
      <supportedOn ref="windows:SUPPORTED_Windows_11_0_24H2" />
      <!-- "Enabled" here means we are turning off API Sampling. -->
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="TurnOffApplicationFootprint" class="Machine" displayName="$(string.AppDeviceInventoryTurnOffApplicationFootprint)" explainText="$(string.AppDeviceInventoryTurnOffApplicationFootprint_Help)" key="Software\Policies\Microsoft\Windows\AppCompat" valueName="DisableApplicationFootprint">
      <parentCategory ref="AppDeviceInventory" />
      <supportedOn ref="windows:SUPPORTED_Windows_11_0_24H2" />
      <!-- "Enabled" here means we are turning off App Footprint. -->
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="TurnOffWin32AppBackup" class="Machine" displayName="$(string.AppDeviceInventoryTurnOffWin32AppBackup)" explainText="$(string.AppDeviceInventoryTurnOffWin32AppBackup_Help)" key="Software\Policies\Microsoft\Windows\AppCompat" valueName="DisableWin32AppBackup">
      <parentCategory ref="AppDeviceInventory" />
      <supportedOn ref="windows:SUPPORTED_Windows_11_0_24H2" />
      <!-- "Enabled" here means we are turning off the Win32 app backup and the backup compat scan for applications. -->
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
  </policies>
</policyDefinitions>
