<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2015 Microsoft Corporation  -->
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <policyNamespaces>
    <target prefix="cloudcontent" namespace="Microsoft.Policies.CloudContent" />
    <using prefix="windows" namespace="Microsoft.Policies.Windows" />
  </policyNamespaces>
  <resources minRequiredRevision="1.0" />
  <categories>
    <category name="CloudContent" displayName="$(string.CloudContent)">
      <parentCategory ref="windows:WindowsComponents" />
    </category>
  </categories>
  <policies>
    <policy name="ConfigureWindowsSpotlight" class="User" displayName="$(string.ConfigureWindowsSpotlight)" explainText="$(string.ConfigureWindowsSpotlight_Help)" presentation="$(presentation.ConfigureWindowsSpotlight)" key="Software\Policies\Microsoft\Windows\CloudContent" valueName="ConfigureWindowsSpotlight">
      <parentCategory ref="CloudContent" />
      <supportedOn ref="windows:SUPPORTED_Windows_10_0_NOSERVER" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="2" />
      </disabledValue>
      <elements>
        <boolean id="ConfigureWindowsSpotlight_Checkbox" valueName="IncludeEnterpriseSpotlight">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
      </elements>
    </policy>
    <policy name="DisableWindowsSpotlightFeatures" class="User" displayName="$(string.DisableWindowsSpotlightFeatures)" explainText="$(string.DisableWindowsSpotlightFeatures_Help)" key="Software\Policies\Microsoft\Windows\CloudContent" valueName="DisableWindowsSpotlightFeatures">
      <parentCategory ref="CloudContent" />
      <supportedOn ref="windows:SUPPORTED_Windows_10_0_NOSERVER" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="DisableTailoredExperiencesWithDiagnosticData" class="User" displayName="$(string.DisableTailoredExperiencesWithDiagnosticData)" explainText="$(string.DisableTailoredExperiencesWithDiagnosticData_Help)" key="Software\Policies\Microsoft\Windows\CloudContent" valueName="DisableTailoredExperiencesWithDiagnosticData">
      <parentCategory ref="CloudContent" />
      <supportedOn ref="windows:SUPPORTED_Windows_10_0_RS2" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="DisableWindowsConsumerFeatures" class="Machine" displayName="$(string.DisableWindowsConsumerFeatures)" explainText="$(string.DisableWindowsConsumerFeatures_Help)" key="Software\Policies\Microsoft\Windows\CloudContent" valueName="DisableWindowsConsumerFeatures">
      <parentCategory ref="CloudContent" />
      <supportedOn ref="windows:SUPPORTED_Windows_10_0_NOSERVER" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="DisableSoftLanding" class="Machine" displayName="$(string.DisableSoftLanding)" explainText="$(string.DisableSoftLanding_Help)" key="Software\Policies\Microsoft\Windows\CloudContent" valueName="DisableSoftLanding">
      <parentCategory ref="CloudContent" />
      <supportedOn ref="windows:SUPPORTED_Windows_10_0_NOSERVER" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="DisableSpotlightCollectionOnDesktop" class="User" displayName="$(string.DisableSpotlightCollectionOnDesktop)" explainText="$(string.DisableSpotlightCollectionOnDesktop_Help)" key="Software\Policies\Microsoft\Windows\CloudContent" valueName="DisableSpotlightCollectionOnDesktop">
      <parentCategory ref="CloudContent" />
      <supportedOn ref="windows:SUPPORTED_Windows_10_0_NOSERVER" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="DisableThirdPartySuggestions" class="User" displayName="$(string.DisableThirdPartySuggestions)" explainText="$(string.DisableThirdPartySuggestions_Help)" key="Software\Policies\Microsoft\Windows\CloudContent" valueName="DisableThirdPartySuggestions">
      <parentCategory ref="CloudContent" />
      <supportedOn ref="windows:SUPPORTED_Windows_10_0_NOSERVER" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="DisableWindowsSpotlightOnActionCenter" class="User" displayName="$(string.DisableWindowsSpotlightOnActionCenter)" explainText="$(string.DisableWindowsSpotlightOnActionCenter_Help)" key="Software\Policies\Microsoft\Windows\CloudContent" valueName="DisableWindowsSpotlightOnActionCenter">
      <parentCategory ref="CloudContent" />
      <supportedOn ref="windows:SUPPORTED_Windows_10_0_RS2" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="DisableWindowsSpotlightOnSettings" class="User" displayName="$(string.DisableWindowsSpotlightOnSettings)" explainText="$(string.DisableWindowsSpotlightOnSettings_Help)" key="Software\Policies\Microsoft\Windows\CloudContent" valueName="DisableWindowsSpotlightOnSettings">
      <parentCategory ref="CloudContent" />
      <supportedOn ref="windows:SUPPORTED_Windows_10_0_RS4" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="DisableWindowsSpotlightWindowsWelcomeExperience" class="User" displayName="$(string.DisableWindowsSpotlightWindowsWelcomeExperience)" explainText="$(string.DisableWindowsSpotlightWindowsWelcomeExperience_Help)" key="Software\Policies\Microsoft\Windows\CloudContent" valueName="DisableWindowsSpotlightWindowsWelcomeExperience">
      <parentCategory ref="CloudContent" />
      <supportedOn ref="windows:SUPPORTED_Windows_10_0_RS2" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="DisableCloudOptimizedContent" class="Machine" displayName="$(string.DisableCloudOptimizedContent)" explainText="$(string.DisableCloudOptimizedContent_Help)" key="Software\Policies\Microsoft\Windows\CloudContent" valueName="DisableCloudOptimizedContent">
      <parentCategory ref="CloudContent" />
      <supportedOn ref="windows:SUPPORTED_Windows_10_0_RS7" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="DisableConsumerAccountStateContent" class="Machine" displayName="$(string.DisableConsumerAccountStateContent)" explainText="$(string.DisableConsumerAccountStateContent_Help)" key="Software\Policies\Microsoft\Windows\CloudContent" valueName="DisableConsumerAccountStateContent">
      <parentCategory ref="CloudContent" />
      <supportedOn ref="windows:SUPPORTED_Windows_10_0_RS7" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="EnableOrganizationalMessages" class="User" displayName="$(string.EnableOrganizationalMessagesContent)" explainText="$(string.EnableOrganizationalMessagesContent_Help)" key="Software\Policies\Microsoft\Windows\CloudContent" valueName="EnableOrganizationalMessages">
      <parentCategory ref="CloudContent" />
      <supportedOn ref="windows:SUPPORTED_Windows_11_0_NOSERVER" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
  </policies>
</policyDefinitions>
